// --------------------------------------------------------------------------------
// 전역
// --------------------------------------------------------------------------------

// 전역 (Global Scope) -> 어디서나 접근가능
// let scope = '전역'


// --------------------------------------------------------------------------------
// 전역
// --------------------------------------------------------------------------------



// {
// // 블록 (Block Scope)
// let scope = '지역' 

// {
//   // 중첩된 블록 (Nested Block Scope)
//   // let scope = '중첩된 지역'

//   // console.log(scope)
// }
// }

// --------------------------------------------------------------------------------
// 함수
// --------------------------------------------------------------------------------

// 저역 변수
let name = '전역'
let nickname = '야무'

// 함수
function 함수() {
  // 함수의 지역변수
  let name = '함수'

  function 중첩된함수() {
    // 중첩된 함수의 지역변수
    let name = '중첩된 함수'

    console.log(1, name)
    console.log(1, nickname) // undefined
  }

  중첩된함수()

  console.log(2, name)
}

함수()
  console.log(3, name)

// 중첩된 함수